app/views/posts/_form.html.erb

  <div class="field">
    <%= collection_check_boxes("post", :tag_ids, Tag.all, :id, :name) %>
---
SELECT "tags".* FROM "tags"